ERP.belugaerp/src/AccumulationRegisters/бг_СуммовыеСкидкиЛокальные/бг_СуммовыеСкидкиЛокальные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_СуммовыеСкидкиЛокальные</name>
  <resources>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСписанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктНазначения</name>
    <type>
      <types>CatalogRef.битПунктыНазначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкидкаНаценка</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/AccumulationRegisters/бг_СуммовыеСкидкиЛокальные/RecordSetModule.bsl
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	БлокироватьДляИзменения = Истина;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Р.Период КАК Период,
		|	Р.Организация КАК Организация,
		|	Р.Контрагент КАК Контрагент,
		|	Р.ПунктНазначения КАК ПунктПогрузки,
		|	Р.СкидкаНаценка КАК СкидкаНаценка,
		|	Р.Начислено КАК Начислено
		|ПОМЕСТИТЬ бг_СуммовыеСкидкиЛокальные_ДвиженияПередЗаписью
		|ИЗ
		|	РегистрНакопления.бг_СуммовыеСкидкиЛокальные КАК Р
		|ГДЕ
		|	Р.Регистратор = &Регистратор"
	);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыИзменений = РегистрыНакопления.бг_СуммовыеСкидкиЛокальные.ИмяВременнойТаблицыИзменений();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.Период КАК Период,
		|	Т.АналитикаУчетаПоПартнерам.Организация КАК Организация,
		|	Т.Организация КАК Организация,
		|	Т.Контрагент КАК Контрагент,
		|	Т.ПунктНазначения КАК ПунктПогрузки,
		|	Т.СкидкаНаценка КАК СкидкаНаценка,
		|	СУММА(Т.Начислено) КАК Начислено
		|ПОМЕСТИТЬ ВТ_ИзмененияДвижений
		|ИЗ
		|	(ВЫБРАТЬ
		|		Т.Период КАК Период,
		|		Т.Организация КАК Организация,
		|		Т.Контрагент КАК Контрагент,
		|		Т.ПунктНазначения КАК ПунктПогрузки,
		|		Т.СкидкаНаценка КАК СкидкаНаценка,
		|		Т.Начислено КАК Начислено
		|	ИЗ
		|		бг_СуммовыеСкидкиЛокальные_ДвиженияПередЗаписью КАК Т
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Р.Период,
		|		Р.Организация КАК Организация,
		|		Р.Контрагент КАК Контрагент,
		|		Р.ПунктНазначения КАК ПунктПогрузки,
		|		Р.СкидкаНаценка,
		|		-Р.Начислено
		|	ИЗ
		|		РегистрНакопления.бг_СуммовыеСкидкиЛокальные КАК Р
		|	ГДЕ
		|		Р.Регистратор = &Регистратор) КАК Т
		|
		|СГРУППИРОВАТЬ ПО
		|	Т.Период,
		|	Т.Организация,
		|	Т.Контрагент,
		|	Т.ПунктНазначения,
		|	Т.СкидкаНаценка,
		|	Т.АналитикаУчетаПоПартнерам.Организация
		|
		|ИМЕЮЩИЕ
		|	СУММА(Т.Начислено) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ бг_СуммовыеСкидкиЛокальные_ДвиженияПередЗаписью"
	);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ИзмененияДвижений", ИмяТаблицыИзменений);
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Результаты = Запрос.ВыполнитьПакет();
	Выборка    = Результаты[0].Выбрать();
	Выборка.Следующий();
	
	ПроведениеДокументов.ЗарегистрироватьТаблицуКонтроля(
		ДополнительныеСвойства,
		ИмяТаблицыИзменений,
		Выборка.Количество
	);
	
КонецПроцедуры

#КонецОбласти
